In [ ]:
import pandas as pd

locdf = pd.read_excel('서울시행정동별중심좌표.xlsx')
df1 = pd.read_excel('029_df1.xlsx')
df2 = pd.read_excel('9218_df1.xlsx')
df3 = pd.read_excel('18224_df1.xlsx')

In [ ]:
locdf.head()

   Unnamed: 0        코드    시도명 시군구명   읍면동명           X          Y
0         NaN  11110515  서울특별시  종로구  청운효자동  126.970417  37.584658
1         NaN  11110530  서울특별시  종로구    사직동  126.970144  37.574108
2         NaN  11110540  서울특별시  종로구    삼청동  126.981114  37.588013
3         NaN  11110550  서울특별시  종로구    부암동  126.962557  37.596699
4         NaN  11110560  서울특별시  종로구    평창동  126.969274  37.613965

In [ ]:
# 필요없는 column을 날려봅시다.
locdf = locdf.drop('Unnamed: 0',axis = 1)

locdf = locdf.drop('코드',axis = 1)

locdf = locdf.drop('시도명',axis = 1)

locdf = locdf.drop('시군구명',axis = 1)

In [ ]:
locdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 424 entries, 0 to 423
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   읍면동명    424 non-null    object
 1   X       424 non-null    float64
 2   Y       424 non-null    float64
dtypes: float64(2), object(1)
memory usage: 10.1+ KB

In [ ]:
locdf = locdf.rename(columns = {'읍면동명': 'dong'} )

In [ ]:
tdf1 = pd.merge(locdf , df1 , how = 'right')

In [ ]:
tdf1.info() 
#위도 경도의 null값이 존재하네요 왜그런지 알아보야겠네여

<class 'pandas.core.frame.DataFrame'>
Int64Index: 425 entries, 0 to 424
Data columns (total 13 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   dong     425 non-null    object
 1   X        239 non-null    float64
 2   Y        239 non-null    float64
 3   highway  425 non-null    float64
 4   ffnc     425 non-null    float64
 5   ffc      425 non-null    float64
 6   nfnc     425 non-null    float64
 7   nfc      425 non-null    float64
 8   fsnc     425 non-null    float64
 9   fsc      425 non-null    float64
 10  nsnc     425 non-null    float64
 11  nsc      425 non-null    float64
 12  총생활인구수   425 non-null    float64
dtypes: float64(12), object(1)
memory usage: 46.5+ KB

In [ ]:
# 데이터를 확인해본결과 저희가 만든 데이터는 청산1동 이런식으로 되어있는데
# 위도 경도 데이터는 청산제1동 이렇게 되어있네요 이걸 수정해야될것 같습니다.
locdf = pd.read_excel('서울시행정동별중심좌표.xlsx')

In [ ]:
locdf.head()

   Unnamed: 0        코드    시도명 시군구명   읍면동명           X          Y
0         NaN  11110515  서울특별시  종로구  청운효자동  126.970417  37.584658
1         NaN  11110530  서울특별시  종로구    사직동  126.970144  37.574108
2         NaN  11110540  서울특별시  종로구    삼청동  126.981114  37.588013
3         NaN  11110550  서울특별시  종로구    부암동  126.962557  37.596699
4         NaN  11110560  서울특별시  종로구    평창동  126.969274  37.613965

In [ ]:
# 필요없는 column을 날려봅시다.
locdf = locdf.drop('Unnamed: 0',axis = 1)

locdf = locdf.drop('코드',axis = 1)

locdf = locdf.drop('시도명',axis = 1)

locdf = locdf.drop('시군구명',axis = 1)

In [ ]:
locdf = locdf.rename(columns = {'읍면동명': 'dong'} )

In [ ]:
tdf1 = pd.merge(locdf , df1 , how = 'right')

In [ ]:
tdf1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 424 entries, 0 to 423
Data columns (total 13 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   dong     424 non-null    object
 1   X        424 non-null    float64
 2   Y        424 non-null    float64
 3   highway  424 non-null    float64
 4   ffnc     424 non-null    float64
 5   ffc      424 non-null    float64
 6   nfnc     424 non-null    float64
 7   nfc      424 non-null    float64
 8   fsnc     424 non-null    float64
 9   fsc      424 non-null    float64
 10  nsnc     424 non-null    float64
 11  nsc      424 non-null    float64
 12  총생활인구수   424 non-null    float64
dtypes: float64(12), object(1)
memory usage: 46.4+ KB

In [ ]:
# df2와 df3에도 똑같이 적용해줍니다.
tdf2 = pd.merge(locdf , df2 , how = 'right')
tdf3 = pd.merge(locdf , df3 , how = 'right')

In [ ]:
#마지막으로 파일을 저장합니다.
tdf1.to_excel('loc_029_df.xlsx')
tdf2.to_excel('loc_9218_df.xlsx')
tdf3.to_excel('loc_18224_df.xlsx')

In [ ]:
tdf2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 424 entries, 0 to 423
Data columns (total 14 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   dong        424 non-null    object
 1   X           424 non-null    float64
 2   Y           424 non-null    float64
 3   highway     0 non-null      float64
 4   Unnamed: 0  424 non-null    int64
 5   ffnc        276 non-null    float64
 6   ffc         0 non-null      float64
 7   nfnc        0 non-null      float64
 8   nfc         0 non-null      float64
 9   fsnc        327 non-null    float64
 10  fsc         0 non-null      float64
 11  nsnc        299 non-null    float64
 12  nsc         0 non-null      float64
 13  총생활인구수      424 non-null    float64
dtypes: float64(12), int64(1), object(1)
memory usage: 49.7+ KB

In [ ]:
tdf3.head(10)

   dong           X          Y  highway  ...  fsc      nsnc  nsc    총생활인구수
0  가락1동  127.108235  37.495329      NaN  ...  NaN  0.000000  NaN  0.277379
1  가락2동  127.130643  37.495860      NaN  ...  NaN  0.061224  NaN  0.287096
2  가락본동  127.121640  37.497217      NaN  ...  NaN  0.020408  NaN  0.407595
3  가리봉동  126.888257  37.482555      NaN  ...  NaN  0.734694  NaN  0.102105
4   가산동  126.884341  37.476835      NaN  ...  NaN  0.857143  NaN  0.536664
5  가양1동  126.834347  37.573101      NaN  ...  NaN  0.306122  NaN  0.511891
6  가양2동  126.854007  37.568657      NaN  ...  NaN       NaN  NaN  0.153992
7  가양3동  126.862297  37.562682      NaN  ...  NaN  0.020408  NaN  0.088571
8   가회동  126.986618  37.582676      NaN  ...  NaN  0.000000  NaN  0.013440
9  갈현1동  126.914887  37.625353      NaN  ...  NaN       NaN  NaN  0.260107

[10 rows x 14 columns]